codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efh144.h
#define _CNENK_CNIEK5_POSITION                   0x00000005
#define _CNENK_CNIEK5_MASK                       0x00000020
#define _CNENK_CNIEK5_LENGTH                     0x00000001

#define _CNENK_CNIEK6_POSITION                   0x00000006
#define _CNENK_CNIEK6_MASK                       0x00000040
#define _CNENK_CNIEK6_LENGTH                     0x00000001

#define _CNENK_CNIEK7_POSITION                   0x00000007
#define _CNENK_CNIEK7_MASK                       0x00000080
#define _CNENK_CNIEK7_LENGTH                     0x00000001

#define _CNENK_w_POSITION                        0x00000000
#define _CNENK_w_MASK                            0xFFFFFFFF
#define _CNENK_w_LENGTH                          0x00000020

#define _CNSTATK_CNSTATK0_POSITION               0x00000000
#define _CNSTATK_CNSTATK0_MASK                   0x00000001
#define _CNSTATK_CNSTATK0_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK1_POSITION               0x00000001
#define _CNSTATK_CNSTATK1_MASK                   0x00000002
#define _CNSTATK_CNSTATK1_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK2_POSITION               0x00000002
#define _CNSTATK_CNSTATK2_MASK                   0x00000004
#define _CNSTATK_CNSTATK2_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK3_POSITION               0x00000003
#define _CNSTATK_CNSTATK3_MASK                   0x00000008
#define _CNSTATK_CNSTATK3_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK4_POSITION               0x00000004
#define _CNSTATK_CNSTATK4_MASK                   0x00000010
#define _CNSTATK_CNSTATK4_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK5_POSITION               0x00000005
#define _CNSTATK_CNSTATK5_MASK                   0x00000020
#define _CNSTATK_CNSTATK5_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK6_POSITION               0x00000006
#define _CNSTATK_CNSTATK6_MASK                   0x00000040
#define _CNSTATK_CNSTATK6_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK7_POSITION               0x00000007
#define _CNSTATK_CNSTATK7_MASK                   0x00000080
#define _CNSTATK_CNSTATK7_LENGTH                 0x00000001

#define _CNSTATK_w_POSITION                      0x00000000
#define _CNSTATK_w_MASK                          0xFFFFFFFF
#define _CNSTATK_w_LENGTH                        0x00000020

#define _CNNEK_CNNEK0_POSITION                   0x00000000
#define _CNNEK_CNNEK0_MASK                       0x00000001
#define _CNNEK_CNNEK0_LENGTH                     0x00000001

#define _CNNEK_CNNEK1_POSITION                   0x00000001
#define _CNNEK_CNNEK1_MASK                       0x00000002
#define _CNNEK_CNNEK1_LENGTH                     0x00000001

#define _CNNEK_CNNEK2_POSITION                   0x00000002
#define _CNNEK_CNNEK2_MASK                       0x00000004
#define _CNNEK_CNNEK2_LENGTH                     0x00000001

#define _CNNEK_CNNEK3_POSITION                   0x00000003
#define _CNNEK_CNNEK3_MASK                       0x00000008
#define _CNNEK_CNNEK3_LENGTH                     0x00000001

#define _CNNEK_CNNEK4_POSITION                   0x00000004
#define _CNNEK_CNNEK4_MASK                       0x00000010
#define _CNNEK_CNNEK4_LENGTH                     0x00000001

#define _CNNEK_CNNEK5_POSITION                   0x00000005
#define _CNNEK_CNNEK5_MASK                       0x00000020
#define _CNNEK_CNNEK5_LENGTH                     0x00000001

#define _CNNEK_CNNEK6_POSITION                   0x00000006
#define _CNNEK_CNNEK6_MASK                       0x00000040
#define _CNNEK_CNNEK6_LENGTH                     0x00000001

#define _CNNEK_CNNEK7_POSITION                   0x00000007
#define _CNNEK_CNNEK7_MASK                       0x00000080
#define _CNNEK_CNNEK7_LENGTH                     0x00000001

#define _CNFK_CNFK0_POSITION                     0x00000000
#define _CNFK_CNFK0_MASK                         0x00000001
#define _CNFK_CNFK0_LENGTH                       0x00000001

#define _CNFK_CNFK1_POSITION                     0x00000001
#define _CNFK_CNFK1_MASK                         0x00000002
#define _CNFK_CNFK1_LENGTH                       0x00000001

#define _CNFK_CNFK2_POSITION                     0x00000002
#define _CNFK_CNFK2_MASK                         0x00000004
#define _CNFK_CNFK2_LENGTH                       0x00000001

#define _CNFK_CNFK3_POSITION                     0x00000003
#define _CNFK_CNFK3_MASK                         0x00000008
#define _CNFK_CNFK3_LENGTH                       0x00000001

#define _CNFK_CNFK4_POSITION                     0x00000004
#define _CNFK_CNFK4_MASK                         0x00000010
#define _CNFK_CNFK4_LENGTH                       0x00000001

#define _CNFK_CNFK5_POSITION                     0x00000005
#define _CNFK_CNFK5_MASK                         0x00000020
#define _CNFK_CNFK5_LENGTH                       0x00000001

#define _CNFK_CNFK6_POSITION                     0x00000006
#define _CNFK_CNFK6_MASK                         0x00000040
#define _CNFK_CNFK6_LENGTH                       0x00000001

#define _CNFK_CNFK7_POSITION                     0x00000007
#define _CNFK_CNFK7_MASK                         0x00000080
#define _CNFK_CNFK7_LENGTH                       0x00000001

#define _C1CON_DNCNT_POSITION                    0x00000000
#define _C1CON_DNCNT_MASK                        0x0000001F
#define _C1CON_DNCNT_LENGTH                      0x00000005

#define _C1CON_CANBUSY_POSITION                  0x0000000B
#define _C1CON_CANBUSY_MASK                      0x00000800
#define _C1CON_CANBUSY_LENGTH                    0x00000001

#define _C1CON_SIDL_POSITION                     0x0000000D
#define _C1CON_SIDL_MASK                         0x00002000
#define _C1CON_SIDL_LENGTH                       0x00000001

#define _C1CON_ON_POSITION                       0x0000000F
#define _C1CON_ON_MASK                           0x00008000
#define _C1CON_ON_LENGTH                         0x00000001

#define _C1CON_CANCAP_POSITION                   0x00000014
#define _C1CON_CANCAP_MASK                       0x00100000
#define _C1CON_CANCAP_LENGTH                     0x00000001

#define _C1CON_OPMOD_POSITION                    0x00000015
#define _C1CON_OPMOD_MASK                        0x00E00000
#define _C1CON_OPMOD_LENGTH                      0x00000003

