codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efh144.h
/* Base Addresses for Peripherals */
#define _CAN1_BASE_ADDRESS                       0xBF880000
#define _CAN2_BASE_ADDRESS                       0xBF881000
#define _CFG_BASE_ADDRESS                        0xBF800000
#define _CMP1_BASE_ADDRESS                       0xBF84C000
#define _CMP2_BASE_ADDRESS                       0xBF84C010
#define _CMP_BASE_ADDRESS                        0xBF84C000
#define _CRU_BASE_ADDRESS                        0xBF801200
#define _CVR_BASE_ADDRESS                        0xBF800E00
#define _DMAC_BASE_ADDRESS                       0xBF811000
#define _DMT_BASE_ADDRESS                        0xBF800A00
#define _EBI_BASE_ADDRESS                        0xBF8E1014
#define _ETH_BASE_ADDRESS                        0xBF882000
#define _I2C1_BASE_ADDRESS                       0xBF820000
#define _I2C2_BASE_ADDRESS                       0xBF820200
#define _I2C3_BASE_ADDRESS                       0xBF820400
#define _I2C4_BASE_ADDRESS                       0xBF820600
#define _I2C5_BASE_ADDRESS                       0xBF820800
#define _ICAP1_BASE_ADDRESS                      0xBF842000
#define _ICAP2_BASE_ADDRESS                      0xBF842200
#define _ICAP3_BASE_ADDRESS                      0xBF842400
#define _ICAP4_BASE_ADDRESS                      0xBF842600
#define _ICAP5_BASE_ADDRESS                      0xBF842800
#define _ICAP6_BASE_ADDRESS                      0xBF842A00
#define _ICAP7_BASE_ADDRESS                      0xBF842C00
#define _ICAP8_BASE_ADDRESS                      0xBF842E00
#define _ICAP9_BASE_ADDRESS                      0xBF843000
#define _INT_BASE_ADDRESS                        0xBF810000
#define _NVM_BASE_ADDRESS                        0xBF800600
#define _OCMP1_BASE_ADDRESS                      0xBF844000
#define _OCMP2_BASE_ADDRESS                      0xBF844200
#define _OCMP3_BASE_ADDRESS                      0xBF844400
#define _OCMP4_BASE_ADDRESS                      0xBF844600
#define _OCMP5_BASE_ADDRESS                      0xBF844800
#define _OCMP6_BASE_ADDRESS                      0xBF844A00
#define _OCMP7_BASE_ADDRESS                      0xBF844C00
#define _OCMP8_BASE_ADDRESS                      0xBF844E00
#define _OCMP9_BASE_ADDRESS                      0xBF845000
#define _PCACHE_BASE_ADDRESS                     0xBF8E0000
#define _PMP_BASE_ADDRESS                        0xBF82E000
#define _PORTA_BASE_ADDRESS                      0xBF860020
#define _PORTB_BASE_ADDRESS                      0xBF860120
#define _PORTC_BASE_ADDRESS                      0xBF860220
#define _PORTD_BASE_ADDRESS                      0xBF860320
#define _PORTE_BASE_ADDRESS                      0xBF860420
#define _PORTF_BASE_ADDRESS                      0xBF860520
#define _PORTG_BASE_ADDRESS                      0xBF860620
#define _PORTH_BASE_ADDRESS                      0xBF860720
#define _PORTJ_BASE_ADDRESS                      0xBF860820
#define _PORTK_BASE_ADDRESS                      0xBF860920
#define _RNG_BASE_ADDRESS                        0xBF8E6000
#define _RTCC_BASE_ADDRESS                       0xBF800C00
#define _SB_BASE_ADDRESS                         0xBF8F0510
#define _SPI1_BASE_ADDRESS                       0xBF821000
#define _SPI2_BASE_ADDRESS                       0xBF821200
#define _SPI3_BASE_ADDRESS                       0xBF821400
#define _SPI4_BASE_ADDRESS                       0xBF821600
#define _SPI5_BASE_ADDRESS                       0xBF821800
#define _SPI6_BASE_ADDRESS                       0xBF821A00
#define _SQI1_BASE_ADDRESS                       0xBF8E2000
#define _TMR1_BASE_ADDRESS                       0xBF840000
#define _TMR23_BASE_ADDRESS                      0xBF840200
#define _TMR2_BASE_ADDRESS                       0xBF840200
#define _TMR3_BASE_ADDRESS                       0xBF840400
#define _TMR45_BASE_ADDRESS                      0xBF840600
#define _TMR4_BASE_ADDRESS                       0xBF840600
#define _TMR5_BASE_ADDRESS                       0xBF840800
#define _TMR67_BASE_ADDRESS                      0xBF840A00
#define _TMR6_BASE_ADDRESS                       0xBF840A00
#define _TMR7_BASE_ADDRESS                       0xBF840C00
#define _TMR89_BASE_ADDRESS                      0xBF840E00
#define _TMR8_BASE_ADDRESS                       0xBF840E00
#define _TMR9_BASE_ADDRESS                       0xBF841000
#define _UART1_BASE_ADDRESS                      0xBF822000
#define _UART2_BASE_ADDRESS                      0xBF822200
#define _UART3_BASE_ADDRESS                      0xBF822400
#define _UART4_BASE_ADDRESS                      0xBF822600
#define _UART5_BASE_ADDRESS                      0xBF822800
#define _UART6_BASE_ADDRESS                      0xBF822A00
#define _UARTAB_BASE_ADDRESS                     0xBF822000
#define _UARTCD_BASE_ADDRESS                     0xBF822200
#define _UARTEF_BASE_ADDRESS                     0xBF822400
#define _UARTGH_BASE_ADDRESS                     0xBF822600
#define _UARTJK_BASE_ADDRESS                     0xBF822800
#define _UARTLM_BASE_ADDRESS                     0xBF822A00
#define _USB_BASE_ADDRESS                        0xBF8E3000
#define __DDPSTAT_BASE_ADDRESS                   0xBF801140

/*  The following device macros are predefined by the chipKIT
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MZ2048EFH144
#  define __32MZ2048EFH144 1
#endif
#ifndef __32MZ2048EFH144__
#  define __32MZ2048EFH144__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32MZ
#  define __PIC32MZ 1
#endif
#ifndef __PIC32MZ__
#  define __PIC32MZ__ 1
#endif
#ifndef __PIC32_FLASH_SIZE
#  define __PIC32_FLASH_SIZE 2048
#endif
#ifndef __PIC32_FEATURE_SET
#  define __PIC32_FEATURE_SET "EF"
#endif
#ifndef __PIC32_FEATURE_SET__
#  define __PIC32_FEATURE_SET__ "EF"
#endif
#ifndef __PIC32_FEATURE_SET0
#  define __PIC32_FEATURE_SET0 'E'
#endif
#ifndef __PIC32_FEATURE_SET1
#  define __PIC32_FEATURE_SET1 'F'
#endif
#ifndef __PIC32_PRODUCT_GROUP
#  define __PIC32_PRODUCT_GROUP 'H'
#endif
#ifndef __PIC32_PIN_COUNT
#  define __PIC32_PIN_COUNT 144
#endif

/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_L1CACHE
# define __PIC32_HAS_L1CACHE 1
#endif
#ifndef __PIC32_HAS_MIPS32R2
# define __PIC32_HAS_MIPS32R2 1
#endif
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_DSPR2
# define __PIC32_HAS_DSPR2 1
#endif
#ifndef __PIC32_HAS_FPU64
# define __PIC32_HAS_FPU64 1
#endif

#endif
